In [17]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [18]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')
print(df)

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

# Assign it to a variable called users and use the 'user_id' as index

In [21]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep = '|',index_col= 'user_id')
print(df.head())

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

# See the first 10 and last 10 entries

In [23]:
print("First 10 Rows".center(80,'-'))
print(df.head(10))
print("Last 10 Rows".center(80,'-'))
print(df.tail(10))

---------------------------------First 10 Rows----------------------------------
         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
----------------------------------Last 10 Rows----------------------------------
         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [27]:
# observations of dataset
df.shape[0]

943

# What is the number of columns in the dataset?

In [29]:
# number of columns
df.shape[1]

4

# Print the name of all the columns.

In [31]:
# names of all columns
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# How is the dataset indexed?

In [36]:
print(df.index)

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# What is the data type of each column?

In [38]:
print(df.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Print only the occupation column

In [40]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [43]:
df['occupation'].value_counts().count()

21

# How many different occupations are in this dataset?

In [45]:
df['occupation'].value_counts().sort_values(ascending = False).count()

21

In [46]:
df['occupation'].value_counts().sort_values(ascending = False).head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

# DataFrame Info.

In [48]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# Describe all the columns

In [50]:
df.describe(include ='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

# Summarize only the occupation column

In [52]:
df.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# What is the mean age of users?

In [54]:
df.age.mean()

34.05196182396607

# What is the age with least occurrence?

In [56]:
df.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64